/**
* @file PRACTICE2.c
* @author Курбала І.О. 515-б
* @date 01.07.22
* @brief Навчальна практика
*
* Робота з масивами
*/



//підключення користувацького заголовного файлу
#include "func.h" 

//оголошення основної ф-ї
int main() {
	int* ptr = NULL; //ініціалізація вказівника(массиву)
	
	ptr = malloc(LEN * sizeof(LEN)); //виділення пям'яті для массиву

	InputArray(ptr); //введення массиву
	SortArr(ptr);
	OutArr(ptr);
	printf("\n\n");//відступ для більш зрозумілого вигляду
	puts("////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////");
	printf("\n");
	ComparArr(ptr);
	
	
	free(ptr);//вивільняємо пам'ять
	
	return 0;


}